{
  "characterList": {
    "status": 200,
    "source": "Success",
    "result": {
      "characters": [
        {
          "id": 1,
          "title": "Jon Snow",
          "description": "Jon Snow, born Aegon Targaryen, is the son of Lyanna Stark and Rhaegar Targaryen, the late Prince of Dragonstone. From infancy, Jon is presented as the bastard son of Lord Eddard Stark, Lyanna's brother, and raised by Eddard alongside his lawful children at Winterfell but his true parentage is kept secret from everyone, including Jon himself. In order to escape his bastard status, Jon joins the Night's Watch and is eventually chosen as Lord Commander.",
          "poster": "https://i.pinimg.com/originals/0f/f3/1b/0ff31b995db77283d1041e75d4cec215.jpg"
        },
        {
          "id": 2,
          "title": "Daenerys Targaryen",
          "description": "Daenerys is the only daughter and youngest child of King Aerys II Targaryen, the 'Mad King', and his sister-wife, Rhaella. Her father died during the Sack of King's Landing, before she was even born. The usurper Robert Baratheon installed himself as king, having defeated Aerys in the conquest known as Robert's Rebellion. Her pregnant mother and brother Viserys, fled to the island of Dragonstone, the ancestral home of House Targaryen, to escape Robert. Daenerys's brother Rhaegar Targaryen was killed in the war by Robert. The forces of House Lannister murdered Rhaegar's wife, Elia Martell, and their children, Rhaenys and Aegon, during the Sack of King's Landing.",
          "poster": "https://i.pinimg.com/564x/82/e5/72/82e5721a7f81a4b3bee4090a3845e561.jpg"
        },
        {
          "id": 3,
          "title": "Cersei Lannister",
          "description": "Cersei is the only daughter and eldest child of Lord Tywin Lannister and his wife Joanna Lannister, who was also his cousin. Tywin is the head of House Lannister, the richest man in the Seven Kingdoms and Lord Paramount of the Westerlands. The Westerlands are one of the constituent regions of the Seven Kingdoms and House Lannister is one of the Great Houses of the realm. Cersei is the elder twin of Ser Jaime Lannister and the elder sister of Tyrion Lannister. She was raised in privilege in the family seat of Casterly Rock.[2] She is noted for her great beauty.",
          "poster": "https://i.pinimg.com/564x/9a/4c/10/9a4c1004db2accea7b6acbb9e2fd055f.jpg"
        },
        {
          "id": 4,
          "title": "Tyrion Lannister",
          "description": "Tyrion Lannister is the youngest son of Joanna Lannister and Lord Tywin Lannister. Tywin is the head of House Lannister, the richest man in the Seven Kingdoms and Lord Paramount of the Westerlands. The Westerlands are one of the constituent regions of the Seven Kingdoms and House Lannister of Casterly Rock is one of the Great Houses of the realm. He is the younger brother of Jaime and Cersei Lannister. His mother Joanna Lannister died giving birth to him. His father and sister blame Tyrion for the death.",
          "poster": "https://i.pinimg.com/564x/5d/55/fd/5d55fd147593d19388e108ec9acce857.jpg"
        },
        {
          "id": 5,
          "title": "Arya Stark",
          "description": "Arya Stark is the youngest daughter and third child of Lady Catelyn and Lord Eddard Stark. Eddard was the head of House Stark and Lord Paramount of the North. The North is one of the constituent regions of the Seven Kingdoms and House Stark is one of the Great Houses of the realm. House Stark rules the region from their seat of Winterfell and Eddard also holds the title Lord of Winterfell. He is also the Warden of the North to King Robert Baratheon.",
          "poster": "https://i.pinimg.com/564x/53/2d/15/532d15f4c03b3110272ccd123fcbd8e5.jpg"
        }
      ]
    }
  }
}
